In [2]:
import pandas as pd

In [3]:
学生信息 = pd.read_excel(R'../data/xls/w9demo.xlsx')
学生信息

      学号  姓名  计算机  英语  大学语文
0  P0245  小明   50  90    80
1  P0246  小丽   60  80    85
2  P0247  阿强   70  70    78
3  P0248  阿珍   80  60    75
4  P0249  大壮   90  50    77

In [ ]:
学生信息.姓名

0    小明
1    小丽
2    阿强
3    阿珍
4    大壮
Name: 姓名, dtype: object

In [5]:
学生信息['大学语文']

0    80
1    85
2    78
3    75
4    77
Name: 大学语文, dtype: int64

In [7]:
学生信息[['大学语文','英语']]

   大学语文  英语
0    80  90
1    85  80
2    78  70
3    75  60
4    77  50

In [8]:
学生信息[['大学语文']]

   大学语文
0    80
1    85
2    78
3    75
4    77

In [11]:
[1,[2,2],'3']

[1, [2, 2], '3']

In [ ]:
学生信息.loc[0,'大学语文']
# loc 是根据标签索引数据，通常用于行索引和列索引，第一个参数是行索引，第二个参数是列索引

np.int64(80)

In [ ]:
学生信息.loc[2]

学号      P0247
姓名         阿强
计算机        70
英语         70
大学语文       78
Name: 2, dtype: object

In [14]:
学生信息.loc[2,['大学语文','英语']]

大学语文    78
英语      70
Name: 2, dtype: object

In [15]:
学生信息.loc[[1,2],['大学语文','英语']]

   大学语文  英语
1    85  80
2    78  70

In [ ]:
学生信息.loc[1:4,['大学语文','英语']]

   大学语文  英语
1    85  80
2    78  70
3    75  60
4    77  50

In [29]:
list1 = ['',0,1,2,3,4,5,6,7,8,9,10,13,23,34]

In [32]:
list1[2:10]

[1, 2, 3, 4, 5, 6, 7, 8]

In [ ]:
# 什么是布尔列表
# 布尔列表是一种特殊的列表，它的元素只有True和False两种值
# [True,False,True,False,True]